# GetMainEnergyAnalysisDetailModel Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisDetailModel..::..GetMainEnergyAnalysisDetailModel Method
EnergyAnalysisDetailModel Class See Also
---
Gets the EnergyAnalysisDetailModel in given document.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static EnergyAnalysisDetailModel GetMainEnergyAnalysisDetailModel(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetMainEnergyAnalysisDetailModel ( _
	document As Document _
) As EnergyAnalysisDetailModel
```

Visual C++
---
```text
public:
static EnergyAnalysisDetailModel^ GetMainEnergyAnalysisDetailModel(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document that contains the physical model of the building.
# ### Return Value
Returns the EnergyAnalysisDetailModel contained in the document, if it exists. If it does not exist, this returns nullNothingnullptra null reference (Nothing in Visual Basic).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace